---
kind: method
id: M:Autodesk.Revit.DB.DimensionType.GetOrdinateDimensionSetting
source: html/97c6109a-f5af-eccf-5db7-2a72f608b685.htm
---
# Autodesk.Revit.DB.DimensionType.GetOrdinateDimensionSetting Method

Gets the ordinate dimension settings for this DimensionType.

## Syntax (C#)
```csharp
public OrdinateDimensionSetting GetOrdinateDimensionSetting()
```

## Returns
The ordinate dimension settings.